Процедура ОбновитьКурсыВалютРегламентное() Экспорт
	
    Результат = РаботаСAPI.ОбновитьКурсыВалют();
    
    // Записываем результат в журнал регистрации
    Если Результат Тогда
        ЗаписьЖурналаРегистрации(
            "Обновление курсов валют", 
            УровеньЖурналаРегистрации.Информация, 
            , , 
            "Курсы валют успешно обновлены автоматически"
        );
    Иначе
        ЗаписьЖурналаРегистрации(
            "Обновление курсов валют", 
            УровеньЖурналаРегистрации.Ошибка, 
            , , 
            "Ошибка при автоматическом обновлении курсов валют"
        );
    КонецЕсли;
    
КонецПроцедуры